# Agrupaciones

Método **groupby** para agrupar fials mediante funciones de agregación

In [12]:
import pandas as pd

# creamos un diciconario
ventas= {
    'Comercial': ['Juan', 'Maria', 'Manuel', 'Vanesa', 'Ana', 'Marcos'],
    'Empresa': ['Movistar', 'Jazztel', 'Movistar', 'Jazztel', 'Vodafone', 'Vodafone'],
    'Primas': [300, 220, 140, 70, 400, 175]
}
df= pd.DataFrame(ventas)
df

  Comercial   Empresa  Primas
0      Juan  Movistar     300
1     Maria   Jazztel     220
2    Manuel  Movistar     140
3    Vanesa   Jazztel      70
4       Ana  Vodafone     400
5    Marcos  Vodafone     175

In [16]:
df.groupby('Empresa') # genera objeto DataFrameGroupBy

In [18]:
por_empresa= df.groupby('Empresa') # se ha de guardar, porque lo guarda en memoria
print(por_empresa)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000024462BAC5C0>

In [20]:
# Prima media por empresa
por_empresa['Primas'].mean()

Empresa
Jazztel     145.0
Movistar    220.0
Vodafone    287.5
Name: Primas, dtype: float64

In [22]:
# Desviación estándar (dispersión del conjunto)
por_empresa['Primas'].std()

Empresa
Jazztel     106.066017
Movistar    113.137085
Vodafone    159.099026
Name: Primas, dtype: float64

In [26]:
# Primas mínimas
por_empresa.min() # los valores los da mal!

         Comercial  Primas
Empresa
Jazztel      Maria      70
Movistar      Juan     140
Vodafone       Ana     175

In [28]:
# ID de las primas mínimas
por_empresa.idxmin()

          Comercial  Primas
Empresa
Jazztel           1       3
Movistar          0       2
Vodafone          4       5

In [30]:
# usamos las ID de las primas mínimas como uente del df
df.loc[por_empresa['Primas'].idxmin()]

  Comercial   Empresa  Primas
3    Vanesa   Jazztel      70
2    Manuel  Movistar     140
5    Marcos  Vodafone     175

In [32]:
# primas máximas
df.loc[por_empresa['Primas'].idxmax()]

  Comercial   Empresa  Primas
1     Maria   Jazztel     220
0      Juan  Movistar     300
4       Ana  Vodafone     400

In [36]:
por_empresa.count() # contador

          Comercial  Primas
Empresa
Jazztel           2       2
Movistar          2       2
Vodafone          2       2

In [38]:
# reporte de analíticas descriptivas
por_empresa.describe()

         Primas
          count   mean         std    min     25%    50%     75%    max
Empresa
Jazztel     2.0  145.0  106.066017   70.0  107.50  145.0  182.50  220.0
Movistar    2.0  220.0  113.137085  140.0  180.00  220.0  260.00  300.0
Vodafone    2.0  287.5  159.099026  175.0  231.25  287.5  343.75  400.0

In [40]:
# reporte transpuesto
por_empresa.describe().transpose()

Empresa          Jazztel    Movistar    Vodafone
Primas count    2.000000    2.000000    2.000000
       mean   145.000000  220.000000  287.500000
       std    106.066017  113.137085  159.099026
       min     70.000000  140.000000  175.000000
       25%    107.500000  180.000000  231.250000
       50%    145.000000  220.000000  287.500000
       75%    182.500000  260.000000  343.750000
       max    220.000000  300.000000  400.000000

In [46]:
# reporte transpuesto de una sola empresa
por_empresa.describe().transpose()['Movistar']

Primas  count      2.000000
        mean     220.000000
        std      113.137085
        min      140.000000
        25%      180.000000
        50%      220.000000
        75%      260.000000
        max      300.000000
Name: Movistar, dtype: float64